patchew-project/qemu/hw/dma/rp2040_dma.c
/*
 * RP2040 DMA emulation
 *
 * SPDX-License-Identifier: GPL-2.0-or-later
 */

#include "qemu/osdep.h"
#include "qapi/error.h"
#include "hw/core/irq.h"
#include "hw/core/qdev-properties.h"
#include "hw/dma/rp2040_dma.h"
#include "hw/misc/rp2040_nyi.h"
#include "migration/vmstate.h"
#include "qemu/bitops.h"
#include "qemu/host-utils.h"
#include "qemu/log.h"
#include "qemu/main-loop.h"
#include "qemu/module.h"
#include "qemu/timer.h"

#define DMA_CH_SIZE              0x40
#define DMA_CH_READ_ADDR         0x00
#define DMA_CH_WRITE_ADDR        0x04
#define DMA_CH_TRANS_COUNT       0x08
#define DMA_CH_CTRL_TRIG         0x0c
#define DMA_CH_AL1_CTRL          0x10
#define DMA_CH_AL1_READ_ADDR     0x14
#define DMA_CH_AL1_WRITE_ADDR    0x18
#define DMA_CH_AL1_TRANS_COUNT   0x1c
#define DMA_CH_AL2_CTRL          0x20
#define DMA_CH_AL2_TRANS_COUNT   0x24
#define DMA_CH_AL2_READ_ADDR     0x28
#define DMA_CH_AL2_WRITE_ADDR    0x2c
#define DMA_CH_AL3_CTRL          0x30
#define DMA_CH_AL3_WRITE_ADDR    0x34
#define DMA_CH_AL3_TRANS_COUNT   0x38
#define DMA_CH_AL3_READ_ADDR     0x3c

#define DMA_INTR                 0x400
#define DMA_INTE0                0x404
#define DMA_INTF0                0x408
#define DMA_INTS0                0x40c
#define DMA_INTE1                0x414
#define DMA_INTF1                0x418
#define DMA_INTS1                0x41c
#define DMA_TIMER0               0x420
#define DMA_MULTI_CHAN_TRIGGER   0x430
#define DMA_SNIFF_CTRL           0x434
#define DMA_SNIFF_DATA           0x438
#define DMA_FIFO_LEVELS          0x440
#define DMA_CHAN_ABORT           0x444

#define DMA_CTRL_AHB_ERROR       BIT(31)
#define DMA_CTRL_READ_ERROR      BIT(30)
#define DMA_CTRL_WRITE_ERROR     BIT(29)
#define DMA_CTRL_BUSY            BIT(24)
#define DMA_CTRL_SNIFF_EN        BIT(23)
#define DMA_CTRL_BSWAP           BIT(22)
#define DMA_CTRL_IRQ_QUIET       BIT(21)
#define DMA_CTRL_TREQ_SEL_SHIFT  15
#define DMA_CTRL_TREQ_SEL_MASK   (0x3f << DMA_CTRL_TREQ_SEL_SHIFT)
#define DMA_CTRL_CHAIN_TO_SHIFT  11
#define DMA_CTRL_CHAIN_TO_MASK   (0xf << DMA_CTRL_CHAIN_TO_SHIFT)
#define DMA_CTRL_RING_SEL        BIT(10)
#define DMA_CTRL_RING_SIZE_SHIFT 6
#define DMA_CTRL_RING_SIZE_MASK  (0xf << 6)
#define DMA_CTRL_INCR_WRITE      BIT(5)
#define DMA_CTRL_INCR_READ       BIT(4)
#define DMA_CTRL_DATA_SIZE_SHIFT 2
#define DMA_CTRL_DATA_SIZE_MASK  (0x3 << DMA_CTRL_DATA_SIZE_SHIFT)
#define DMA_CTRL_EN              BIT(0)
#define DMA_CTRL_ERROR_MASK      (DMA_CTRL_AHB_ERROR | \
                                  DMA_CTRL_READ_ERROR | \
                                  DMA_CTRL_WRITE_ERROR)

#define DMA_SNIFF_CTRL_OUT_INV   BIT(11)
#define DMA_SNIFF_CTRL_OUT_REV   BIT(10)
#define DMA_SNIFF_CTRL_BSWAP     BIT(9)
#define DMA_SNIFF_CTRL_CALC_SHIFT 5
#define DMA_SNIFF_CTRL_CALC_MASK  (0xf << DMA_SNIFF_CTRL_CALC_SHIFT)
#define DMA_SNIFF_CTRL_DMACH_SHIFT 1
#define DMA_SNIFF_CTRL_DMACH_MASK (0xf << DMA_SNIFF_CTRL_DMACH_SHIFT)
#define DMA_SNIFF_CTRL_EN        BIT(0)
#define DMA_SNIFF_CTRL_MASK      0xfff

#define DMA_SNIFF_CALC_CRC32     0x0
#define DMA_SNIFF_CALC_CRC32R    0x1
#define DMA_SNIFF_CALC_CRC16     0x2
#define DMA_SNIFF_CALC_CRC16R    0x3
#define DMA_SNIFF_CALC_EVEN      0xe
#define DMA_SNIFF_CALC_SUM       0xf

#define DMA_CTRL_WRITABLE_MASK   (DMA_CTRL_SNIFF_EN | DMA_CTRL_BSWAP | \
                                  DMA_CTRL_IRQ_QUIET | \
                                  DMA_CTRL_TREQ_SEL_MASK | \
                                  DMA_CTRL_CHAIN_TO_MASK | \
                                  DMA_CTRL_RING_SEL | \
                                  DMA_CTRL_RING_SIZE_MASK | \
                                  DMA_CTRL_INCR_WRITE | \
                                  DMA_CTRL_INCR_READ | \
                                  DMA_CTRL_DATA_SIZE_MASK | \
                                  BIT(1) | DMA_CTRL_EN)
#define DMA_CHANNEL_MASK         ((1u << RP2040_DMA_NUM_CHANNELS) - 1)
#define DMA_PACING_SYSCLK_HZ     125000000ULL
#define DMA_PACING_SYSCLK_NS     8ULL

#define ATOMIC_ALIAS_MASK        0x3000
#define ATOMIC_XOR               0x1000
#define ATOMIC_SET               0x2000
#define ATOMIC_CLR               0x3000

static uint32_t rp2040_dma_apply_alias(uint32_t old, uint32_t value,
                                       hwaddr alias)
{
    switch (alias) {
    case ATOMIC_XOR:
        return old ^ value;
    case ATOMIC_SET:
        return old | value;
    case ATOMIC_CLR:
        return old & ~value;
    default:
        return value;
    }
}

static uint32_t rp2040_dma_ints(RP2040DmaState *s, unsigned irq)
{
    return ((s->intr & s->inte[irq]) | s->intf[irq]) & DMA_CHANNEL_MASK;
}

static void rp2040_dma_update_irq(RP2040DmaState *s)
{
    int i;

    for (i = 0; i < RP2040_DMA_NUM_IRQS; i++) {
        qemu_set_irq(s->irq[i], rp2040_dma_ints(s, i) != 0);
    }
}

static unsigned rp2040_dma_transfer_size(RP2040DmaChannel *ch)
{
    switch ((ch->ctrl & DMA_CTRL_DATA_SIZE_MASK) >> DMA_CTRL_DATA_SIZE_SHIFT) {
    case 0:
        return 1;
    case 1:
        return 2;
    case 2:
        return 4;
    default:
        return 4;
    }
}

static void rp2040_dma_request_start(RP2040DmaState *s, unsigned index);
static void rp2040_dma_dreq(void *opaque, int n, int level);
static void rp2040_dma_dreq_pulse(RP2040DmaState *s, uint32_t dreq);
static void rp2040_dma_dreq_bh(void *opaque);
static bool rp2040_dma_dreq_has_busy_channel(RP2040DmaState *s, uint32_t dreq,
                                             unsigned except);
static void rp2040_dma_write_reg(RP2040DmaState *s, hwaddr addr,
                                 uint64_t value64, unsigned size);

static uint32_t rp2040_dma_treq(RP2040DmaChannel *ch)
{
    return (ch->ctrl & DMA_CTRL_TREQ_SEL_MASK) >> DMA_CTRL_TREQ_SEL_SHIFT;
}

static bool rp2040_dma_treq_is_ready_sink(uint32_t treq)
{
    /*
     * The current XIP/SSI TX model does not have a finite TX FIFO: writes to
     * its data register are accepted immediately.
     */
    return treq == RP2040_DREQ_XIP_SSITX;
}

static bool rp2040_dma_treq_is_connected_level(uint32_t treq)
{
    return treq == RP2040_DREQ_UART0_TX || treq == RP2040_DREQ_UART0_RX ||
           treq == RP2040_DREQ_UART1_TX || treq == RP2040_DREQ_UART1_RX ||
           treq == RP2040_DREQ_XIP_STREAM;
}

static bool rp2040_dma_treq_is_timer(uint32_t treq)
{
    return treq >= RP2040_DREQ_DMA_TIMER0 &&
           treq <= RP2040_DREQ_DMA_TIMER3;
}

