patchew-project/qemu/hw/dma/rp2040_dma.c
static uint64_t rp2040_dma_timer_period_ns(uint32_t value)
{
    uint32_t x = value >> 16;
    uint32_t y = value & 0xffff;
    uint64_t period;

    if (x == 0 || y == 0) {
        return 0;
    }

    /*
     * The RP2040 fractional timer emits TREQs at (X/Y) * sys_clk, capped
     * at one TREQ per sys_clk. Use the Pico's nominal 125 MHz system clock
     * as the virtual pacing source.
     */
    if (x >= y) {
        return DMA_PACING_SYSCLK_NS;
    }

    period = DIV_ROUND_UP((uint64_t)y * NANOSECONDS_PER_SECOND,
                          (uint64_t)x * DMA_PACING_SYSCLK_HZ);
    return MAX(period, 1);
}

static void rp2040_dma_timer_update(RP2040DmaState *s, unsigned index)
{
    RP2040DmaPacingTimer *pt = &s->pacing_timer[index];

    pt->period_ns = rp2040_dma_timer_period_ns(s->timer[index]);
    if (pt->period_ns == 0) {
        timer_del(pt->timer);
        return;
    }

    timer_mod(pt->timer, qemu_clock_get_ns(QEMU_CLOCK_VIRTUAL) +
              pt->period_ns);
}

static void rp2040_dma_timer_cb(void *opaque)
{
    RP2040DmaPacingTimer *pt = opaque;
    RP2040DmaState *s = pt->dma;
    uint32_t dreq = RP2040_DREQ_DMA_TIMER0 + pt->index;

    if (rp2040_dma_dreq_has_busy_channel(s, dreq, RP2040_DMA_NUM_CHANNELS)) {
        rp2040_dma_dreq_pulse(s, dreq);
    }
    if (pt->period_ns != 0) {
        timer_mod(pt->timer, qemu_clock_get_ns(QEMU_CLOCK_VIRTUAL) +
                  pt->period_ns);
    }
}

static uint32_t rp2040_dma_next_addr(RP2040DmaChannel *ch, uint32_t addr,
                                     unsigned width, bool write)
{
    uint32_t ring_size;
    bool ring_write;
    uint32_t mask;

    if (!(ch->ctrl & (write ? DMA_CTRL_INCR_WRITE : DMA_CTRL_INCR_READ))) {
        return addr;
    }

    ring_size = (ch->ctrl & DMA_CTRL_RING_SIZE_MASK) >>
                DMA_CTRL_RING_SIZE_SHIFT;
    ring_write = ch->ctrl & DMA_CTRL_RING_SEL;
    if (ring_size == 0 || ring_write != write) {
        return addr + width;
    }

    mask = (1u << ring_size) - 1;
    return (addr & ~mask) | ((addr + width) & mask);
}

static uint32_t rp2040_dma_sniff_word(const uint8_t *buf, unsigned width)
{
    uint32_t value = buf[0];

    if (width >= 2) {
        value |= (uint32_t)buf[1] << 8;
    }
    if (width >= 4) {
        value |= (uint32_t)buf[2] << 16;
        value |= (uint32_t)buf[3] << 24;
    }
    return value;
}

static void rp2040_dma_sniff_bswap(uint8_t *buf, unsigned width)
{
    if (width == 2) {
        uint8_t t = buf[0];
        buf[0] = buf[1];
        buf[1] = t;
    } else if (width == 4) {
        uint8_t t = buf[0];
        buf[0] = buf[3];
        buf[3] = t;
        t = buf[1];
        buf[1] = buf[2];
        buf[2] = t;
    }
}

static uint32_t rp2040_dma_sniff_crc32(uint32_t crc, const uint8_t *buf,
                                       unsigned width, bool reverse)
{
    int i;
    int bit;

    for (i = 0; i < width; i++) {
        uint8_t byte = reverse ? revbit8(buf[i]) : buf[i];

        crc ^= (uint32_t)byte << 24;
        for (bit = 0; bit < 8; bit++) {
            crc = (crc & BIT(31)) ? (crc << 1) ^ 0x04c11db7 : crc << 1;
        }
    }
    return crc;
}

static uint32_t rp2040_dma_sniff_crc16(uint32_t crc, const uint8_t *buf,
                                       unsigned width, bool reverse)
{
    uint16_t crc16 = crc;
    int i;
    int bit;

    for (i = 0; i < width; i++) {
        uint8_t byte = reverse ? revbit8(buf[i]) : buf[i];

        crc16 ^= (uint16_t)byte << 8;
        for (bit = 0; bit < 8; bit++) {
            crc16 = (crc16 & BIT(15)) ? (crc16 << 1) ^ 0x1021 : crc16 << 1;
        }
    }
    return (crc & 0xffff0000) | crc16;
}

static void rp2040_dma_sniff_update(RP2040DmaState *s, unsigned index,
                                    const uint8_t *buf, unsigned width)
{
    RP2040DmaChannel *ch = &s->chan[index];
    uint8_t sniff_buf[4] = { 0 };
    uint32_t channel;
    uint32_t calc;
    uint32_t value;

    if (!(s->sniff_ctrl & DMA_SNIFF_CTRL_EN) ||
        !(ch->ctrl & DMA_CTRL_SNIFF_EN)) {
        return;
    }

    channel = (s->sniff_ctrl & DMA_SNIFF_CTRL_DMACH_MASK) >>
              DMA_SNIFF_CTRL_DMACH_SHIFT;
    if (channel != index) {
        return;
    }

    memcpy(sniff_buf, buf, width);
    if (s->sniff_ctrl & DMA_SNIFF_CTRL_BSWAP) {
        rp2040_dma_sniff_bswap(sniff_buf, width);
    }

    calc = (s->sniff_ctrl & DMA_SNIFF_CTRL_CALC_MASK) >>
           DMA_SNIFF_CTRL_CALC_SHIFT;
    switch (calc) {
    case DMA_SNIFF_CALC_CRC32:
        s->sniff_data = rp2040_dma_sniff_crc32(s->sniff_data, sniff_buf,
                                               width, false);
        break;
    case DMA_SNIFF_CALC_CRC32R:
        s->sniff_data = rp2040_dma_sniff_crc32(s->sniff_data, sniff_buf,
                                               width, true);
        break;
    case DMA_SNIFF_CALC_CRC16:
        s->sniff_data = rp2040_dma_sniff_crc16(s->sniff_data, sniff_buf,
                                               width, false);
        break;
    case DMA_SNIFF_CALC_CRC16R:
        s->sniff_data = rp2040_dma_sniff_crc16(s->sniff_data, sniff_buf,
                                               width, true);
        break;
    case DMA_SNIFF_CALC_EVEN:
        value = rp2040_dma_sniff_word(sniff_buf, width);
        s->sniff_data = (s->sniff_data ^ ctpop32(value)) & 1;
        break;
    case DMA_SNIFF_CALC_SUM:
        s->sniff_data += rp2040_dma_sniff_word(sniff_buf, width);
        break;
    default:
        break;
    }
}

static uint32_t rp2040_dma_sniff_read_data(RP2040DmaState *s)
{
    uint32_t value = s->sniff_data;

    if (s->sniff_ctrl & DMA_SNIFF_CTRL_OUT_REV) {
        value = revbit32(value);
    }
    if (s->sniff_ctrl & DMA_SNIFF_CTRL_OUT_INV) {
        value = ~value;
    }
    return value;
}

static void rp2040_dma_finish_channel(RP2040DmaState *s, unsigned index)
{
    RP2040DmaChannel *ch = &s->chan[index];
    uint32_t chain_to;

    ch->ctrl &= ~DMA_CTRL_BUSY;
    if (!(ch->ctrl & DMA_CTRL_IRQ_QUIET)) {
        s->intr |= BIT(index);
        rp2040_dma_update_irq(s);
    }

