patchew-project/qemu/hw/dma/rp2040_dma.c
    chain_to = (ch->ctrl & DMA_CTRL_CHAIN_TO_MASK) >> DMA_CTRL_CHAIN_TO_SHIFT;
    if (!(ch->ctrl & DMA_CTRL_ERROR_MASK) &&
        chain_to < RP2040_DMA_NUM_CHANNELS && chain_to != index) {
        rp2040_dma_request_start(s, chain_to);
    }
}

static void rp2040_dma_run_beats(RP2040DmaState *s, unsigned index,
                                 uint32_t beats)
{
    RP2040DmaChannel *ch = &s->chan[index];
    uint32_t count;
    unsigned width;

    if (!(ch->ctrl & DMA_CTRL_EN) || ch->trans_count == 0) {
        return;
    }

    width = rp2040_dma_transfer_size(ch);
    count = MIN(ch->trans_count, beats);

    while (count--) {
        uint8_t buf[4] = { 0 };
        MemTxResult result;

        result = address_space_rw(&s->dma_as, ch->read_addr,
                                  MEMTXATTRS_UNSPECIFIED, buf, width, false);
        if (result != MEMTX_OK) {
            ch->ctrl |= DMA_CTRL_READ_ERROR | DMA_CTRL_AHB_ERROR;
            break;
        }

        if (ch->ctrl & DMA_CTRL_BSWAP) {
            if (width == 2) {
                uint8_t t = buf[0];
                buf[0] = buf[1];
                buf[1] = t;
            } else if (width == 4) {
                uint8_t t = buf[0];
                buf[0] = buf[3];
                buf[3] = t;
                t = buf[1];
                buf[1] = buf[2];
                buf[2] = t;
            }
        }
        rp2040_dma_sniff_update(s, index, buf, width);

        if (ch->write_addr >= RP2040_DMA_BASE &&
            ch->write_addr < RP2040_DMA_BASE + RP2040_DMA_SIZE) {
            if (width == 4) {
                rp2040_dma_write_reg(s, ch->write_addr - RP2040_DMA_BASE,
                                     ldl_le_p(buf), width);
                result = MEMTX_OK;
            } else {
                result = MEMTX_ERROR;
            }
        } else {
            result = address_space_rw(&s->dma_as, ch->write_addr,
                                      MEMTXATTRS_UNSPECIFIED, buf, width,
                                      true);
        }
        if (result != MEMTX_OK) {
            ch->ctrl |= DMA_CTRL_WRITE_ERROR | DMA_CTRL_AHB_ERROR;
            break;
        }

        ch->trans_count--;
        ch->read_addr = rp2040_dma_next_addr(ch, ch->read_addr, width, false);
        ch->write_addr = rp2040_dma_next_addr(ch, ch->write_addr, width, true);
    }

    if ((ch->ctrl & DMA_CTRL_ERROR_MASK) || ch->trans_count == 0) {
        rp2040_dma_finish_channel(s, index);
    }
}

static void rp2040_dma_start_channel(RP2040DmaState *s, unsigned index)
{
    RP2040DmaChannel *ch = &s->chan[index];
    uint32_t treq;

    if (!(ch->ctrl & DMA_CTRL_EN)) {
        return;
    }

    if (ch->trans_count == 0 && ch->reload_count != 0) {
        ch->trans_count = ch->reload_count;
    }

    if (ch->trans_count == 0) {
        if (ch->ctrl & DMA_CTRL_IRQ_QUIET) {
            s->intr |= BIT(index);
            rp2040_dma_update_irq(s);
        }
        return;
    }

    ch->ctrl |= DMA_CTRL_BUSY;
    ch->ctrl &= ~DMA_CTRL_ERROR_MASK;
    ch->paced_nyi_logged = false;

    treq = rp2040_dma_treq(ch);
    if (treq == RP2040_DREQ_FORCE || rp2040_dma_treq_is_ready_sink(treq)) {
        rp2040_dma_run_beats(s, index, UINT32_MAX);
    } else if ((rp2040_dma_treq_is_connected_level(treq) ||
                treq == RP2040_DREQ_XIP_SSIRX) && s->dreq_level[treq]) {
        rp2040_dma_dreq_pulse(s, treq);
    } else if (treq != RP2040_DREQ_XIP_SSIRX &&
               !rp2040_dma_treq_is_connected_level(treq) &&
               !rp2040_dma_treq_is_timer(treq) &&
               !ch->paced_nyi_logged) {
        rp2040_log_nyi("dma", "paced transfer",
                       "DREQ source is not connected yet");
        ch->paced_nyi_logged = true;
    }
}

static void rp2040_dma_drain_starts(RP2040DmaState *s)
{
    if (s->engine_active) {
        return;
    }

    s->engine_active = true;
    while (s->pending_start) {
        unsigned index = ctz32(s->pending_start);

        s->pending_start &= ~BIT(index);
        rp2040_dma_start_channel(s, index);
    }
    s->engine_active = false;
}

static void rp2040_dma_request_start(RP2040DmaState *s, unsigned index)
{
    if (index >= RP2040_DMA_NUM_CHANNELS) {
        return;
    }

    s->pending_start |= BIT(index);
    rp2040_dma_drain_starts(s);
}

static void rp2040_dma_dreq_pulse(RP2040DmaState *s, uint32_t dreq)
{
    if (dreq >= RP2040_DMA_NUM_DREQS) {
        return;
    }

    if (s->pending_dreq[dreq] != UINT32_MAX) {
        s->pending_dreq[dreq]++;
    }
    qemu_bh_schedule(s->dreq_bh);
}

static void rp2040_dma_dreq(void *opaque, int n, int level)
{
    RP2040DmaState *s = opaque;

    if (n < 0 || n >= RP2040_DMA_NUM_DREQS) {
        return;
    }

    s->dreq_level[n] = level;
    if (level) {
        rp2040_dma_dreq_pulse(s, n);
        if (rp2040_dma_treq_is_connected_level(n)) {
            rp2040_dma_dreq_bh(s);
        }
    }
}

static void rp2040_dma_dreq_bh(void *opaque)
{
    RP2040DmaState *s = opaque;
    int i;
    int dreq;

    if (s->dreq_servicing) {
        return;
    }

    s->dreq_servicing = true;
    for (dreq = 0; dreq < RP2040_DMA_NUM_DREQS; dreq++) {
        while (s->pending_dreq[dreq] > 0) {
            s->pending_dreq[dreq]--;
            for (i = 0; i < RP2040_DMA_NUM_CHANNELS; i++) {
                RP2040DmaChannel *ch = &s->chan[i];

                if ((ch->ctrl & DMA_CTRL_BUSY) && rp2040_dma_treq(ch) == dreq) {
                    s->engine_active = true;
                    rp2040_dma_run_beats(s, i, 1);
                    s->engine_active = false;
                    rp2040_dma_drain_starts(s);
                }
            }
            if (s->dreq_level[dreq] &&
                rp2040_dma_dreq_has_busy_channel(s, dreq,
                                                 RP2040_DMA_NUM_CHANNELS)) {
                rp2040_dma_dreq_pulse(s, dreq);
            }
        }
    }
    s->dreq_servicing = false;
}

static bool rp2040_dma_dreq_has_busy_channel(RP2040DmaState *s, uint32_t dreq,
                                             unsigned except)
{
    int i;

