patchew-project/qemu/hw/dma/rp2040_dma.c
    for (i = 0; i < RP2040_DMA_NUM_CHANNELS; i++) {
        RP2040DmaChannel *ch = &s->chan[i];

        if (i != except && (ch->ctrl & DMA_CTRL_BUSY) &&
            rp2040_dma_treq(ch) == dreq) {
            return true;
        }
    }
    return false;
}

static void rp2040_dma_abort_channel(RP2040DmaState *s, unsigned index)
{
    RP2040DmaChannel *ch = &s->chan[index];
    uint32_t treq = rp2040_dma_treq(ch);

    /*
     * RP2040 CHAN_ABORT clears the transfer counter and leaves the channel
     * inactive. QEMU does not model in-flight bus-transfer latency, so the
     * abort status bit is clear as soon as the write completes.
     */
    ch->ctrl &= ~DMA_CTRL_BUSY;
    ch->trans_count = 0;
    if (treq < RP2040_DMA_NUM_DREQS &&
        !rp2040_dma_dreq_has_busy_channel(s, treq, index)) {
        s->pending_dreq[treq] = 0;
    }
}

static uint32_t rp2040_dma_read_channel(RP2040DmaState *s, unsigned index,
                                        hwaddr offset)
{
    RP2040DmaChannel *ch = &s->chan[index];

    switch (offset) {
    case DMA_CH_READ_ADDR:
    case DMA_CH_AL1_READ_ADDR:
    case DMA_CH_AL2_READ_ADDR:
    case DMA_CH_AL3_READ_ADDR:
        return ch->read_addr;
    case DMA_CH_WRITE_ADDR:
    case DMA_CH_AL1_WRITE_ADDR:
    case DMA_CH_AL2_WRITE_ADDR:
    case DMA_CH_AL3_WRITE_ADDR:
        return ch->write_addr;
    case DMA_CH_TRANS_COUNT:
    case DMA_CH_AL1_TRANS_COUNT:
    case DMA_CH_AL2_TRANS_COUNT:
    case DMA_CH_AL3_TRANS_COUNT:
        return ch->trans_count;
    case DMA_CH_CTRL_TRIG:
    case DMA_CH_AL1_CTRL:
    case DMA_CH_AL2_CTRL:
    case DMA_CH_AL3_CTRL:
        return ch->ctrl;
    default:
        return 0;
    }
}

static void rp2040_dma_write_ctrl(RP2040DmaState *s, unsigned index,
                                  uint32_t value, bool trigger)
{
    RP2040DmaChannel *ch = &s->chan[index];
    uint32_t errors = ch->ctrl & DMA_CTRL_ERROR_MASK;

    errors &= ~(value & (DMA_CTRL_READ_ERROR | DMA_CTRL_WRITE_ERROR));
    if (errors & (DMA_CTRL_READ_ERROR | DMA_CTRL_WRITE_ERROR)) {
        errors |= DMA_CTRL_AHB_ERROR;
    } else {
        errors &= ~DMA_CTRL_AHB_ERROR;
    }
    ch->ctrl = (value & DMA_CTRL_WRITABLE_MASK) | errors;
    if (trigger) {
        rp2040_dma_request_start(s, index);
    }
}

static void rp2040_dma_write_channel(RP2040DmaState *s, unsigned index,
                                     hwaddr offset, uint32_t value)
{
    RP2040DmaChannel *ch = &s->chan[index];

    switch (offset) {
    case DMA_CH_READ_ADDR:
    case DMA_CH_AL1_READ_ADDR:
    case DMA_CH_AL2_READ_ADDR:
        ch->read_addr = value;
        break;
    case DMA_CH_AL3_READ_ADDR:
        ch->read_addr = value;
        rp2040_dma_request_start(s, index);
        break;
    case DMA_CH_WRITE_ADDR:
    case DMA_CH_AL1_WRITE_ADDR:
    case DMA_CH_AL3_WRITE_ADDR:
        ch->write_addr = value;
        break;
    case DMA_CH_AL2_WRITE_ADDR:
        ch->write_addr = value;
        rp2040_dma_request_start(s, index);
        break;
    case DMA_CH_TRANS_COUNT:
    case DMA_CH_AL2_TRANS_COUNT:
    case DMA_CH_AL3_TRANS_COUNT:
        ch->trans_count = value;
        ch->reload_count = value;
        break;
    case DMA_CH_AL1_TRANS_COUNT:
        ch->trans_count = value;
        ch->reload_count = value;
        rp2040_dma_request_start(s, index);
        break;
    case DMA_CH_CTRL_TRIG:
        rp2040_dma_write_ctrl(s, index, value, true);
        break;
    case DMA_CH_AL1_CTRL:
    case DMA_CH_AL2_CTRL:
    case DMA_CH_AL3_CTRL:
        rp2040_dma_write_ctrl(s, index, value, false);
        break;
    default:
        break;
    }
}

static uint64_t rp2040_dma_read(void *opaque, hwaddr addr, unsigned size)
{
    RP2040DmaState *s = opaque;
    hwaddr offset = addr & 0xfff;
    uint32_t value;

    if (offset < RP2040_DMA_NUM_CHANNELS * DMA_CH_SIZE) {
        value = rp2040_dma_read_channel(s, offset / DMA_CH_SIZE,
                                        offset % DMA_CH_SIZE);
    } else {
        switch (offset) {
        case DMA_INTR:
            value = s->intr;
            break;
        case DMA_INTE0:
            value = s->inte[0];
            break;
        case DMA_INTF0:
            value = s->intf[0];
            break;
        case DMA_INTS0:
            value = rp2040_dma_ints(s, 0);
            break;
        case DMA_INTE1:
            value = s->inte[1];
            break;
        case DMA_INTF1:
            value = s->intf[1];
            break;
        case DMA_INTS1:
            value = rp2040_dma_ints(s, 1);
            break;
        case DMA_TIMER0 ... DMA_TIMER0 + 3 * sizeof(uint32_t):
            value = s->timer[(offset - DMA_TIMER0) / sizeof(uint32_t)];
            break;
        case DMA_SNIFF_CTRL:
            value = s->sniff_ctrl;
            break;
        case DMA_SNIFF_DATA:
            value = rp2040_dma_sniff_read_data(s);
            break;
        case DMA_FIFO_LEVELS:
            value = 0;
            break;
        case DMA_CHAN_ABORT:
            value = 0;
            break;
        default:
            value = 0;
            qemu_log_mask(LOG_UNIMP, "rp2040.dma: unimplemented read  "
                          "(size %d, addr 0x%08" HWADDR_PRIx
                          ", offset 0x%04" HWADDR_PRIx
                          ") -> 0x%0*" PRIx32 "\n",
                          size, RP2040_DMA_BASE + addr, offset,
                          size << 1, value);
            break;
        }
    }

    return value;
}

static void rp2040_dma_write_reg(RP2040DmaState *s, hwaddr addr,
                                 uint64_t value64, unsigned size)
{
    hwaddr alias = addr & ATOMIC_ALIAS_MASK;
    hwaddr offset = addr & 0xfff;
    uint32_t value = value64;
    uint32_t old;
    int i;

    if (offset < RP2040_DMA_NUM_CHANNELS * DMA_CH_SIZE) {
        rp2040_dma_write_channel(s, offset / DMA_CH_SIZE,
                                 offset % DMA_CH_SIZE, value);
    } else {
        switch (offset) {
        case DMA_INTR:
            s->intr &= ~(value & DMA_CHANNEL_MASK);
            rp2040_dma_update_irq(s);
            break;
        case DMA_INTE0:
            s->inte[0] = rp2040_dma_apply_alias(s->inte[0], value, alias) &
                         DMA_CHANNEL_MASK;
            rp2040_dma_update_irq(s);
            break;
        case DMA_INTF0:
            s->intf[0] = rp2040_dma_apply_alias(s->intf[0], value, alias) &
                         DMA_CHANNEL_MASK;
            rp2040_dma_update_irq(s);
            break;
        case DMA_INTS0:
            s->intr &= ~(value & DMA_CHANNEL_MASK);
            rp2040_dma_update_irq(s);
            break;
        case DMA_INTE1:
            s->inte[1] = rp2040_dma_apply_alias(s->inte[1], value, alias) &
                         DMA_CHANNEL_MASK;
            rp2040_dma_update_irq(s);
            break;
        case DMA_INTF1:
            s->intf[1] = rp2040_dma_apply_alias(s->intf[1], value, alias) &
                         DMA_CHANNEL_MASK;
            rp2040_dma_update_irq(s);
            break;
        case DMA_INTS1:
            s->intr &= ~(value & DMA_CHANNEL_MASK);
            rp2040_dma_update_irq(s);
            break;
        case DMA_TIMER0 ... DMA_TIMER0 + 3 * sizeof(uint32_t):
            i = (offset - DMA_TIMER0) / sizeof(uint32_t);
            s->timer[i] = rp2040_dma_apply_alias(s->timer[i], value, alias);
            rp2040_dma_timer_update(s, i);
            break;
        case DMA_MULTI_CHAN_TRIGGER:
            value &= DMA_CHANNEL_MASK;
            for (i = 0; i < RP2040_DMA_NUM_CHANNELS; i++) {
                if (value & BIT(i)) {
                    rp2040_dma_request_start(s, i);
                }
            }
            break;
        case DMA_SNIFF_CTRL:
            old = s->sniff_ctrl;
            s->sniff_ctrl = rp2040_dma_apply_alias(old, value, alias) &
                            DMA_SNIFF_CTRL_MASK;
            break;
        case DMA_SNIFF_DATA:
            s->sniff_data = rp2040_dma_apply_alias(s->sniff_data, value,
                                                   alias);
            break;
        case DMA_CHAN_ABORT:
            value &= DMA_CHANNEL_MASK;
            for (i = 0; i < RP2040_DMA_NUM_CHANNELS; i++) {
                if (value & BIT(i)) {
                    rp2040_dma_abort_channel(s, i);
                }
            }
            break;
        default:
            qemu_log_mask(LOG_UNIMP, "rp2040.dma: unimplemented write "
                          "(size %d, addr 0x%08" HWADDR_PRIx
                          ", offset 0x%04" HWADDR_PRIx
                          ", value 0x%0*" PRIx64 ")\n",
                          size, RP2040_DMA_BASE + addr, offset, size << 1,
                          value64);
            break;
        }
    }
}

