patchew-project/qemu/hw/dma/rp2040_dma.c
static void rp2040_dma_write(void *opaque, hwaddr addr, uint64_t value64,
                             unsigned size)
{
    rp2040_dma_write_reg(opaque, addr, value64, size);
}

static const MemoryRegionOps rp2040_dma_ops = {
    .read = rp2040_dma_read,
    .write = rp2040_dma_write,
    .endianness = DEVICE_LITTLE_ENDIAN,
    .valid = {
        .min_access_size = 4,
        .max_access_size = 4,
    },
};

static void rp2040_dma_reset(DeviceState *dev)
{
    RP2040DmaState *s = RP2040_DMA(dev);
    int i;

    for (i = 0; i < RP2040_DMA_NUM_CHANNELS; i++) {
        s->chan[i].read_addr = 0;
        s->chan[i].write_addr = 0;
        s->chan[i].trans_count = 0;
        s->chan[i].reload_count = 0;
        s->chan[i].ctrl = i << DMA_CTRL_CHAIN_TO_SHIFT;
        s->chan[i].paced_nyi_logged = false;
    }
    s->intr = 0;
    s->inte[0] = 0;
    s->inte[1] = 0;
    s->intf[0] = 0;
    s->intf[1] = 0;
    memset(s->timer, 0, sizeof(s->timer));
    for (i = 0; i < RP2040_DMA_NUM_TIMERS; i++) {
        s->pacing_timer[i].period_ns = 0;
        timer_del(s->pacing_timer[i].timer);
    }
    memset(s->dreq_level, 0, sizeof(s->dreq_level));
    memset(s->pending_dreq, 0, sizeof(s->pending_dreq));
    qemu_bh_cancel(s->dreq_bh);
    s->engine_active = false;
    s->pending_start = 0;
    s->sniff_ctrl = 0;
    s->sniff_data = 0;
    rp2040_dma_update_irq(s);
}

static void rp2040_dma_init(Object *obj)
{
    RP2040DmaState *s = RP2040_DMA(obj);
    SysBusDevice *sbd = SYS_BUS_DEVICE(obj);
    int i;

    memory_region_init_io(&s->iomem, obj, &rp2040_dma_ops, s,
                          TYPE_RP2040_DMA, RP2040_DMA_SIZE);
    sysbus_init_mmio(sbd, &s->iomem);
    for (i = 0; i < RP2040_DMA_NUM_IRQS; i++) {
        sysbus_init_irq(sbd, &s->irq[i]);
    }
    s->dreq_bh = qemu_bh_new(rp2040_dma_dreq_bh, s);
    qdev_init_gpio_in_named(DEVICE(obj), rp2040_dma_dreq, "dreq",
                            RP2040_DMA_NUM_DREQS);
    for (i = 0; i < RP2040_DMA_NUM_TIMERS; i++) {
        s->pacing_timer[i].dma = s;
        s->pacing_timer[i].index = i;
        s->pacing_timer[i].timer = timer_new_ns(QEMU_CLOCK_VIRTUAL,
                                                rp2040_dma_timer_cb,
                                                &s->pacing_timer[i]);
    }
}

static void rp2040_dma_finalize(Object *obj)
{
    RP2040DmaState *s = RP2040_DMA(obj);
    int i;

    for (i = 0; i < RP2040_DMA_NUM_TIMERS; i++) {
        timer_free(s->pacing_timer[i].timer);
    }
    qemu_bh_delete(s->dreq_bh);
}

static void rp2040_dma_realize(DeviceState *dev, Error **errp)
{
    RP2040DmaState *s = RP2040_DMA(dev);

    if (!s->dma_mr) {
        error_setg(errp, "memory property was not set");
        return;
    }

    address_space_init(&s->dma_as, s->dma_mr, "rp2040-dma-memory");
}

static const VMStateDescription rp2040_dma_vmstate = {
    .name = TYPE_RP2040_DMA,
    .version_id = 1,
    .minimum_version_id = 1,
    .fields = (const VMStateField[]) {
        VMSTATE_END_OF_LIST()
    }
};

static const Property rp2040_dma_properties[] = {
    DEFINE_PROP_LINK("memory", RP2040DmaState, dma_mr, TYPE_MEMORY_REGION,
                     MemoryRegion *),
};

static void rp2040_dma_class_init(ObjectClass *klass, const void *data)
{
    DeviceClass *dc = DEVICE_CLASS(klass);

    dc->realize = rp2040_dma_realize;
    device_class_set_legacy_reset(dc, rp2040_dma_reset);
    dc->vmsd = &rp2040_dma_vmstate;
    device_class_set_props(dc, rp2040_dma_properties);
}

static const TypeInfo rp2040_dma_info = {
    .name          = TYPE_RP2040_DMA,
    .parent        = TYPE_SYS_BUS_DEVICE,
    .instance_size = sizeof(RP2040DmaState),
    .instance_init = rp2040_dma_init,
    .instance_finalize = rp2040_dma_finalize,
    .class_init    = rp2040_dma_class_init,
};

static void rp2040_dma_register_types(void)
{
    type_register_static(&rp2040_dma_info);
}
type_init(rp2040_dma_register_types)
